//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
//
// *++
//
// Copyright (c) 1999 - 2016 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//
//
// Module Name:
//
//   KtiSetupStrings.uni
//
// Abstract:
//
//   String definitions for KTI SvSetup formset.
//
// Revision History:
//
// --*/

/=#

#string STR_KTI_SYSTEMWIDE_FORM_TITLE           #language en-US "UPI SV System Wide Configuration"
#string STR_KTI_SYSTEMWIDE_FORM_HELP            #language en-US "UPI SV System Wide Configuration"
#string STR_KTI_SYSTEM_PHY_LINK_FORM_TITLE      #language en-US "UPI Physical / Link Layer"
#string STR_KTI_SYSTEM_PHY_LINK_FORM_HELP       #language en-US "UPI SV System Wide Physical / Link Layer"
#string STR_KTI_SYSTEM_OSB_FORM_TITLE           #language en-US "UPI OSB"
#string STR_KTI_SYSTEM_OSB_FORM_HELP            #language en-US "UPI SV System Wide OSB"

//----------------------------------------------------------------------------------------
//System Wide Sv Configuration Strings
//----------------------------------------------------------------------------------------

#string STR_KTI_SV_WADISBALE0                   #language en-US "WaDisable0"
#string STR_KTI_SV_WADISBALE_HELP0              #language en-US "Bit 0: Set RTA bad parity error | Bit 3: Deadloop after warm reset |Bit 4: Deadloop after memory init"
#string STR_KTI_SV_WADISBALE1                   #language en-US "WaDisable1"
#string STR_KTI_SV_WADISBALE_HELP1              #language en-US "WaDisable1"

#string STR_KTI_ADV_VNA_CREDIT                  #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C0P0             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C0P1             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C0P2             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C1P0             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C1P1             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C1P2             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C2P0             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C2P1             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C2P2             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C3P0             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C3P1             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C3P2             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C4P0             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C4P1             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C4P2             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C5P0             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C5P1             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C5P2             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C6P0             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C6P1             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C6P2             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C7P0             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C7P1             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_C7P2             #language en-US "Advertised VNA Credits"
#string STR_KTI_ADV_VNA_CREDIT_HELP             #language en-US "VNA Credits require link reset to take effect"
#string STR_KTI_MAX                             #language en-US "Max"
#string STR_KTI_64                              #language en-US "64<Max"
#string STR_KTI_32                              #language en-US "32<Max"

#string STR_KTI_VN2                             #language en-US "2<Max"
#string STR_KTI_VN1                             #language en-US "1<Max"
#string STR_KTI_ADV_VN0_CREDIT                  #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C0P0             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C0P1             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C0P2             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C1P0             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C1P1             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C1P2             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C2P0             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C2P1             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C2P2             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C3P0             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C3P1             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C3P2             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C4P0             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C4P1             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C4P2             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C5P0             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C5P1             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C5P2             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C6P0             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C6P1             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C6P2             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C7P0             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C7P1             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_C7P2             #language en-US "Advertised VN0 Credits"
#string STR_KTI_ADV_VN0_CREDIT_HELP             #language en-US "VN0 Credits require link reset to take effect"

#string STR_KTI_ADV_VN1_CREDIT                  #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C0P0             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C0P1             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C0P2             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C1P0             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C1P1             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C1P2             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C2P0             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C2P1             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C2P2             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C3P0             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C3P1             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C3P2             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C4P0             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C4P1             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C4P2             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C5P0             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C5P1             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C5P2             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C6P0             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C6P1             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C6P2             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C7P0             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C7P1             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_C7P2             #language en-US "Advertised VN1 Credits"
#string STR_KTI_ADV_VN1_CREDIT_HELP             #language en-US "VN1 Credits require link reset to take effect"

#string STR_KTI_PERIOD_RET_INTERVAL_PROMPT      #language en-US "Periodic Retrain Interval"
#string STR_KTI_PERIOD_RET_INTERVAL_HELP        #language en-US "The value of Periodic Retrain Interval, PRT, comes from EPARAM_LINK_INFO tables."

#string STR_KTI_LINK_SPEED_MODE                 #language en-US "Link Speed Mode"
#string STR_KTI_LINK_SPEED_MODE_HELP            #language en-US "Select the UPI link speed as either the POR speed (Fast) or default speed (Slow)"
#string STR_KTI_MODE_SLOW                       #language en-US "Slow"
#string STR_KTI_MODE_FAST                       #language en-US "Fast"

#string STR_KTI_MAX_NUM_PHY_RELNITS             #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C0P0        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C0P1        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C0P2        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C1P0        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C1P1        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C1P2        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C2P0        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C2P1        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C2P2        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C3P0        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C3P1        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C3P2        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C4P0        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C4P1        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C4P2        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C5P0        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C5P1        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C5P2        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C6P0        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C6P1        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C6P2        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C7P0        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C7P1        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_C7P2        #language en-US "Consecutive Phy ReInits"
#string STR_KTI_MAX_NUM_PHY_RELNITS_HELP        #language en-US "Try these many retrys before declaring Link Failure (RETRY_ABORT)"
#string STR_KTI_UPTO3                           #language en-US "Up to 3"
#string STR_KTI_UPTO2                           #language en-US "Up to 2"
#string STR_KTI_UPTO1                           #language en-US "Up to 1"
#string STR_KTI_UPTO0                           #language en-US "Up to 0"

#string STR_KTI_MAX_NUM_LLRS                    #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C0P0               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C0P1               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C0P2               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C1P0               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C1P1               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C1P2               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C2P0               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C2P1               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C2P2               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C3P0               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C3P1               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C3P2               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C4P0               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C4P1               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C4P2               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C5P0               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C5P1               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C5P2               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C6P0               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C6P1               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C6P2               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C7P0               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C7P1               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_C7P2               #language en-US "Consecutive LLRs"
#string STR_KTI_MAX_NUM_LLRS_HELP               #language en-US "Wait for these many number of LLRs before trying Phy ReInit"
#string STR_KTI_15                              #language en-US "15"
#string STR_KTI_14                              #language en-US "14"
#string STR_KTI_13                              #language en-US "13"
#string STR_KTI_12                              #language en-US "12"
#string STR_KTI_11                              #language en-US "11"
#string STR_KTI_10                              #language en-US "10"
#string STR_KTI_9                               #language en-US "9"
#string STR_KTI_8                               #language en-US "8" 
#string STR_KTI_7                               #language en-US "7"
#string STR_KTI_6                               #language en-US "6"
#string STR_KTI_5                               #language en-US "5"
#string STR_KTI_4                               #language en-US "4"
#string STR_KTI_3                               #language en-US "3"
#string STR_KTI_2                               #language en-US "2"
#string STR_KTI_1                               #language en-US "1"

#string STR_KTI_LLR_TIMEOUT                     #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C0P0                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C0P1                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C0P2                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C1P0                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C1P1                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C1P2                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C2P0                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C2P1                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C2P2                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C3P0                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C3P1                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C3P2                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C4P0                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C4P1                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C4P2                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C5P0                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C5P1                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C5P2                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C6P0                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C6P1                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C6P2                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C7P0                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C7P1                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_C7P2                #language en-US "LLR Retry TimeOut"
#string STR_KTI_LLR_TIMEOUT_HELP                #language en-US "LLR Retry TimeOut"
#string STR_KTI_4095FLITS                       #language en-US "4095 flits"
#string STR_KTI_1023FLITS                       #language en-US "1023 flits"
#string STR_KTI_255FLITS                        #language en-US "255 flits"
#string STR_KTI_63FLITS                         #language en-US "63 flits"

#string STR_KTI_CRC_MODE                        #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C0P0                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C0P1                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C0P2                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C1P0                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C1P1                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C1P2                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C2P0                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C2P1                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C2P2                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C3P0                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C3P1                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C3P2                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C4P0                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C4P1                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C4P2                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C5P0                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C5P1                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C5P2                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C6P0                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C6P1                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C6P2                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C7P0                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C7P1                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_C7P2                   #language en-US "CRC Mode"
#string STR_KTI_CRC_MODE_HELP                   #language en-US "Select UPI CRC Mode: Auto sets this to 16-bit."
#string STR_KTI_8BIT_CRC                        #language en-US "8 Bit CRC"
#string STR_KTI_16BIT_ROLLING                   #language en-US "16 Bit rolling CRC"
#string STR_KTI_16BIT_CRC                       #language en-US "16 Bit CRC"
#string STR_KTI_32BIT_ROLLING                   #language en-US "32 Bit rolling CRC"

#string STR_KTI_L0P_C0P0                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C0P1                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C0P2                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C1P0                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C1P1                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C1P2                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C2P0                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C2P1                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C2P2                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C3P0                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C3P1                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C3P2                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C4P0                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C4P1                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C4P2                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C5P0                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C5P1                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C5P2                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C6P0                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C6P1                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C6P2                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C7P0                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C7P1                        #language en-US "L0p enabled"
#string STR_KTI_L0P_C7P2                        #language en-US "L0p enabled"
#string STR_KTI_L0P_HELP                        #language en-US "Enable/Disable per port L0p mode at transmitter which will be ANDed together with the exchanged value of the connected port to determine if the link may enter L0p."

#string STR_KTI_L1_C0P0                        #language en-US "L1 enabled"
#string STR_KTI_L1_C0P1                        #language en-US "L1 enabled"
#string STR_KTI_L1_C0P2                        #language en-US "L1 enabled"
#string STR_KTI_L1_C1P0                        #language en-US "L1 enabled"
#string STR_KTI_L1_C1P1                        #language en-US "L1 enabled"
#string STR_KTI_L1_C1P2                        #language en-US "L1 enabled"
#string STR_KTI_L1_C2P0                        #language en-US "L1 enabled"
#string STR_KTI_L1_C2P1                        #language en-US "L1 enabled"
#string STR_KTI_L1_C2P2                        #language en-US "L1 enabled"
#string STR_KTI_L1_C3P0                        #language en-US "L1 enabled"
#string STR_KTI_L1_C3P1                        #language en-US "L1 enabled"
#string STR_KTI_L1_C3P2                        #language en-US "L1 enabled"
#string STR_KTI_L1_C4P0                        #language en-US "L1 enabled"
#string STR_KTI_L1_C4P1                        #language en-US "L1 enabled"
#string STR_KTI_L1_C4P2                        #language en-US "L1 enabled"
#string STR_KTI_L1_C5P0                        #language en-US "L1 enabled"
#string STR_KTI_L1_C5P1                        #language en-US "L1 enabled"
#string STR_KTI_L1_C5P2                        #language en-US "L1 enabled"
#string STR_KTI_L1_C6P0                        #language en-US "L1 enabled"
#string STR_KTI_L1_C6P1                        #language en-US "L1 enabled"
#string STR_KTI_L1_C6P2                        #language en-US "L1 enabled"
#string STR_KTI_L1_C7P0                        #language en-US "L1 enabled"
#string STR_KTI_L1_C7P1                        #language en-US "L1 enabled"
#string STR_KTI_L1_C7P2                        #language en-US "L1 enabled"
#string STR_KTI_L1_HELP                        #language en-US "Enable/Disable per port L1 which will be ANDed together with the exchanged value of the connected port to determine if the link may enter L1."


#string STR_KTI_PROBE_TYPE_C0P0                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C0P1                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C0P2                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C1P0                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C1P1                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C1P2                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C2P0                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C2P1                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C2P2                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C3P0                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C3P1                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C3P2                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C4P0                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C4P1                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C4P2                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C5P0                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C5P1                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C5P2                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C6P0                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C6P1                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C6P2                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C7P0                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C7P1                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_C7P2                    #language en-US "Probe Type"
#string STR_KTI_PROBE_TYPE_HELP                    #language en-US "Probe Type"
#string STR_KTI_NOT_PRESENT                        #language en-US "NotPresent"
#string STR_KTI_MIDBUS                             #language en-US "MidBus"
#string STR_KTI_INTERPOSER                         #language en-US "InterPoser"

#string STR_KTI_LINKWIDTH                          #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C0P0                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C0P1                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C0P2                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C1P0                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C1P1                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C1P2                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C2P0                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C2P1                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C2P2                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C3P0                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C3P1                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C3P2                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C4P0                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C4P1                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C4P2                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C5P0                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C5P1                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C5P2                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C6P0                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C6P1                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C6P2                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C7P0                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C7P1                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_C7P2                     #language en-US "Link Width Selection"
#string STR_KTI_LINKWIDTH_HELP                     #language en-US "Which Quarters of the link to be enabled"
#string STR_QUAR0                                  #language en-US "Q3Q2Q1Q0"
#string STR_QUAR1                                  #language en-US "Q1Q0"
#string STR_QUAR2                                  #language en-US "Q2Q0"
#string STR_QUAR3                                  #language en-US "Q3Q0"
#string STR_QUAR4                                  #language en-US "Q2Q1"
#string STR_QUAR5                                  #language en-US "Q3Q1"
#string STR_QUAR6                                  #language en-US "Q3Q2"
#string STR_QUAR7                                  #language en-US "Q0"
#string STR_QUAR8                                  #language en-US "Q1"
#string STR_QUAR9                                  #language en-US "Q2"
#string STR_QUAR10                                 #language en-US "Q3"


#string STR_SV_MIN_RTID_0                       #language en-US "Min Rtids Allowed 0"
#string STR_SV_MIN_RTID_1                       #language en-US "Min Rtids Allowed 1"
#string STR_SV_MIN_RTID_2                       #language en-US "Min Rtids Allowed 2"
#string STR_SV_MIN_RTID_3                       #language en-US "Min Rtids Allowed 3"
#string STR_SV_MIN_RTID_4                       #language en-US "Min Rtids Allowed 4"
#string STR_SV_MIN_RTID_5                       #language en-US "Min Rtids Allowed 5"
#string STR_SV_MIN_RTID_6                       #language en-US "Min Rtids Allowed 6"
#string STR_SV_MIN_RTID_7                       #language en-US "Min Rtids Allowed 7"
#string STR_SV_MIN_RTID_HELP                    #language en-US "If enabled, assign min RTIDs allowed. If disable, go with Optimum/Symmetric RTID values"


#string STR_SV_MIN_CREDIT_0                       #language en-US "Min Credits Allowed Skt 0"
#string STR_SV_MIN_CREDIT_1                       #language en-US "Min Credits Allowed Skt 1"
#string STR_SV_MIN_CREDIT_2                       #language en-US "Min Credits Allowed Skt 2"
#string STR_SV_MIN_CREDIT_3                       #language en-US "Min Credits Allowed Skt 3"
#string STR_SV_MIN_CREDIT_4                       #language en-US "Min Credits Allowed Skt 4"
#string STR_SV_MIN_CREDIT_5                       #language en-US "Min Credits Allowed Skt 5"
#string STR_SV_MIN_CREDIT_6                       #language en-US "Min Credits Allowed Skt 6"
#string STR_SV_MIN_CREDIT_7                       #language en-US "Min Credits Allowed Skt 7"
#string STR_SV_MIN_CREDIT_HELP                    #language en-US "If enabled, assign min Credits allowed. If disable, go with optimum credit values"

#string STR_SV_FRC_SHARED_RTID_ONLY             #language en-US "CBo Force Shared RTID Only"
#string STR_SV_FRC_SHARED_RTID_ONLY_HELP        #language en-US "CBo Force transaction waiting for Shared RTID NOT to use General RTID"

#string STR_SV_FRC_ISMQ_RTID                    #language en-US "CBo Force ISMQ RTID"
#string STR_SV_FRC_ISMQ_RTID_HELP               #language en-US "CBo Force all WBs to use only the shared RTID for Eviction"

#string STR_SV_SWAP_RTID                        #language en-US "CBo Swap Lower RTID"
#string STR_SV_SWAP_RTID_HELP                   #language en-US "CBo Swap lower RTID with higher RTID during RTID selection in RemoteHome pools"

#string STR_SV_M_TO_I_BIAS                      #language en-US "M to I Bias"
#string STR_SV_M_TO_I_BIAS_HELP                 #language en-US "Enable MtoIBias instead of MtoS"

#string STR_SV_KTI_SNOOP_BC_MODE                #language en-US "Snoop Mode"
#string STR_SV_KTI_SNOOP_BC_MODE_HELP           #language en-US "Select Snoop Mode"
#string STR_EARLY_SNOOP                         #language en-US "Early Snoop"
#string STR_EARLY_SNOOP_HELP                    #language en-US "Select Early Snoop Mode"
#string STR_HA_SNOOP_NO_DIR                     #language en-US "Home Snoop without Directory"
#string STR_HA_SNOOP_DIR                        #language en-US "Home Snoop with Directory"
#string STR_HA_SNOOP_DIR_OSB                    #language en-US "Home Snoop with Directory and OSB"

#string STR_SV_SNOOP_FANOUT                     #language en-US "Snoop Fanout"
#string STR_SV_SNOOP_FANOUT_HELP                #language en-US "Snoop Fanout"

#string STR_SV_SNOOP_SPWN_THLD                  #language en-US "Snoop Spawn Threshold"
#string STR_SV_SNOOP_SPWN_THLD_HELP             #language en-US "Snoop Spawn Threshold: 2 - 15; default is 2;"

#string STR_SV_DIS_ISOC_EGR_RES                 #language en-US "DisIsocEgrRes"
#string STR_SV_DIS_ISOC_EGR_RES_HELP            #language en-US "Disable ISOC Egress Reservation: Enable (bit value 1), Disable (bit value 0), Auto (default)"

#string STR_SV_HA_D2C                           #language en-US "HA Direct To Core (D2C)"
#string STR_SV_HA_D2C_HELP                      #language en-US "HA Direct To Core (D2C)"
#string STR_SV_HA_D2C_DIS_THLD                  #language en-US "HA D2C Disable Threshold"
#string STR_SV_HA_D2C_DIS_THLD_HELP             #language en-US "HA D2C Disable Threshold: 0 - 7; default is 0."
#string STR_SV_HA_D2C_EN_THLD                   #language en-US "HA D2C Enable Threshold"
#string STR_SV_HA_D2C_EN_THLD_HELP              #language en-US "HA D2C Enable Threshold: 0 - 7; default is 8 (AUTO)."
#string STR_SV_HA_D2C_INDMODE                   #language en-US "HA D2C Individual Mode"
#string STR_SV_HA_D2C_INDMODE_HELP              #language en-US "HA D2C Individual mode enable: 1 - Enable; 0 - Disable (use Sum mode); 2 - Auto (default)"
#string STR_SV_HA_D2C_STATIC_MODE               #language en-US "HA D2C Static Mode"
#string STR_SV_HA_D2C_STATIC_MODE_HELP          #language en-US "HA D2C Static mode enable: 1 - Enable; 0 - Disable (use Dynamic mode); 2 - Auto (default)"

#string STR_SV_AK_FIFO_THLD                     #language en-US "AK FIFO Threshold"
#string STR_SV_AK_FIFO_THLD_HELP                #language en-US "AK FIFO Threshold: 0 - 7; default is 0."
#string STR_SV_M3KTI_COUNT_MISMATCH_ENABLE      #language en-US "M3UPI Count Mismatch"
#string STR_SV_M3KTI_COUNT_MISMATCH_ENABLE_HELP #language en-US "Allow M3UPI Count Mismatch: Enable, Disable"

#string STR_SV_MODE0                            #language en-US "Mode0"
#string STR_SV_MODE1                            #language en-US "Mode1"
#string STR_SV_MODE2                            #language en-US "Mode2"
#string STR_SV_MODE3                            #language en-US "Mode3"
#string STR_SV_MODE4                            #language en-US "Mode4"

#string STR_SV_NUM_HT_SLOTS_RSVD_DRS            #language en-US "HA HT Slots Rsvd For Remote Drs"
#string STR_SV_NUM_HT_SLOTS_RSVD_DRS_HELP       #language en-US "HA HT slots rsvd for remote DRS: 0 - 15; default is 12"
#string STR_SV_NUM_HT_SLOTS_RSVD_LOCAL_REQ      #language en-US "HA HT Slots Rsvd For Local Req"
#string STR_SV_NUM_HT_SLOTS_RSVD_LOCAL_REQ_HELP #language en-US "HA HT slots rsvd for local requests: 0 - 31; default is 3F is Auto"

#string STR_SV_CMP_FWD_INV_OWN_DIS              #language en-US "HA Disable Cmp_FwdInvOwn"
#string STR_SV_CMP_FWD_INV_OWN_DIS_HELP         #language en-US "HA disable Cmp_FwdInvOwn generation during conflict flows"
#string STR_SV_DEFEATURE_GP                     #language en-US "HA Defeature GP to 2 entry/bank"
#string STR_SV_DEFEATURE_GP_HELP                #language en-US "HA Defeature GP to 2 entry/bank"

#string STR_SV_NO_SPLIT                         #language en-US "HA No Split"
#string STR_SV_NO_SPLIT_HELP                    #language en-US "Wait for both critical and non-critical data chunks in the BL egress before sending to ring"

#string STR_SV_BT_BYPASS_DIS                    #language en-US "HA Disable BT Bypass"
#string STR_SV_BT_BYPASS_DIS_HELP               #language en-US "HA Disable BT bypass"

#string STR_SV_IODC                             #language en-US "IO Directory Cache (IODC)"
#string STR_SV_IODC_HELP                        #language en-US "IO Directory Cache (IODC)"
#string STR_SV_GATE_IODC_ALLOC_WITH_OSB         #language en-US "Gate IODC Alloc With OSB"
#string STR_SV_GATE_IODC_ALLOC_WITH_OSB_HELP    #language en-US "Gate IODC allocation with OSB heuristic"
#string STR_SV_EARLY_GO                         #language en-US "Early GO"
#string STR_SV_EARLY_GO_HELP                    #language en-US "Early Global Observation (GO)"

#string STR_SV_HITME                             #language en-US "Hit Me"
#string STR_SV_HITME_HELP                        #language en-US "HA Hit Me Enable"

#string STR_SV_F_TO_S_0                         #language en-US "Downgrade F to S"
#string STR_SV_F_TO_S_1                         #language en-US "Downgrade F to S"
#string STR_SV_F_TO_S_2                         #language en-US "Downgrade F to S"
#string STR_SV_F_TO_S_3                         #language en-US "Downgrade F to S"
#string STR_SV_F_TO_S_4                         #language en-US "Downgrade F to S"
#string STR_SV_F_TO_S_5                         #language en-US "Downgrade F to S"
#string STR_SV_F_TO_S_6                         #language en-US "Downgrade F to S"
#string STR_SV_F_TO_S_7                         #language en-US "Downgrade F to S"
#string STR_SV_F_TO_S_HELP                      #language en-US "Downgrade F to S"
#string STR_SV_DCA_0                            #language en-US "IIO Direct Cache Access (DCA)"
#string STR_SV_DCA_1                            #language en-US "IIO Direct Cache Access (DCA)"
#string STR_SV_DCA_2                            #language en-US "IIO Direct Cache Access (DCA)"
#string STR_SV_DCA_3                            #language en-US "IIO Direct Cache Access (DCA)"
#string STR_SV_DCA_4                            #language en-US "IIO Direct Cache Access (DCA)"
#string STR_SV_DCA_5                            #language en-US "IIO Direct Cache Access (DCA)"
#string STR_SV_DCA_6                            #language en-US "IIO Direct Cache Access (DCA)"
#string STR_SV_DCA_7                            #language en-US "IIO Direct Cache Access (DCA)"
#string STR_SV_DCA_HELP                         #language en-US "IIO Direct Cache Access (DCA)"

#string STR_SV_BIAS_FWD_MODE                    #language en-US "CBo Bias Fwd Mode"
#string STR_SV_BIAS_FWD_MODE_HELP               #language en-US "0 - Mode 0 (Fwd only when Hom != Req, Default); 1 - Mode 1 (Fwd when Hom != Req & Hom != Local); 2 - Mode 2 (Disable Bias Fwd)"

#string STR_SV_DRD_GOS                          #language en-US "Enable GO-S on E/M state for DRD"
#string STR_SV_DRD_GOS_HELP                     #language en-US "CBo Enable GO-S on E/M state for DRD"

#string STR_SV_HALT_LINK_FAIL_RESET             #language en-US "CPU Halt at Link Train Failure"
#string STR_SV_HALT_LINK_FAIL_RESET_HELP        #language en-US "CPU halt when link failed to train. Topology changed across reset. See the serial output"

#string STR_SV_ALWAYS_FLOCAL_EN                 #language en-US "HA AlwaysflocalEn"
#string STR_SV_ALWAYS_FLOCAL_EN_HELP            #language en-US "Keep the line in F state and forward S state on SnpData/Code/Cur/DataMigratory from a local home"

#string STR_SV_COND_DISABLEF_EN                 #language en-US "HA CondDisableF"
#string STR_SV_COND_DISABLEF_EN_HELP            #language en-US "Downgrade from F to S without forwarding on SnpData/Code/Cur/DataMigratory from a remote home "

#string STR_SV_SINGLE_BIT_DIR                   #language en-US "HA Singlebitdir"
#string STR_SV_SINGLE_BIT_DIR_HELP              #language en-US "HA Singlebitdir"
#string STR_SV_DIR_UPDATE_2S_OPT                #language en-US "HA 2S Directory Update Optim"
#string STR_SV_DIR_UPDATE_2S_OPT_HELP           #language en-US "HA 2S Directory update optimization"
#string STR_SV_BT_RSP_BYPASS_DIS                #language en-US "HA Disable Latency Resp Bypass"
#string STR_SV_BT_RSP_BYPASS_DIS_HELP           #language en-US "HA disable latency optimization for response bypass"
#string STR_SV_LOC_DIR_BYPASS_DIS               #language en-US "HA Disable Local Dir Bypass"
#string STR_SV_LOC_DIR_BYPASS_DIS_HELP          #language en-US "HA disable latency optimization for directory mode for local transactions"
#string STR_SV_RMT_DIR_BYPASS_DIS               #language en-US "HA Disable Remote Dir Bypass"
#string STR_SV_RMT_DIR_BYPASS_DIS_HELP          #language en-US "HA disable latency optimization for directory mode for remote transactions"
#string STR_SV_CNFLT_LAT_OPT_DIS                #language en-US "HA Disable Conflict Latency"
#string STR_SV_CNFLT_LAT_OPT_DIS_HELP           #language en-US "HA disable conflict flow latency optimization"
#string STR_SV_IPQ_ANTI_STARV_DIS               #language en-US "HA Disable Credit Anti-Starvation"
#string STR_SV_IPQ_ANTI_STARV_DIS_HELP          #language en-US "HA disable IPQ credit Anti-starvation mechanism"
#string STR_SV_SNP_EARLY_ARB_DIS                #language en-US "HA Disable Snoop Early Arbitrate"
#string STR_SV_SNP_EARLY_ARB_DIS_HELP           #language en-US "HA disable snoop early arbitrate optimization"

#string STR_SV_LOCK_COMP_MODE                   #language en-US "Lock Compatibility Mode"
#string STR_SV_LOCK_COMP_MODE_HELP              #language en-US "Lock Compatibility Mode"

#string STR_SV_WR_COMB_PFACK_CFG                #language en-US "WrComb Pf_Ack Bypass"
#string STR_SV_WR_COMB_PFACK_CFG_HELP           #language en-US "Wr Combine and pf_ack bypass config"
#string STR_SV_WR_COMB_EN_PF_ACK_DIS            #language en-US "WrComb=Enable Pf_Ack=Enable"
#string STR_SV_WR_COMB_DIS_PF_ACK_EN            #language en-US "WrComb=Disable Pf_Ack=Disable"
#string STR_SV_WR_COMB_PF_ACK_SI_DEF            #language en-US "Keep Silicon Default"

#string STR_SV_LOGICAL_INT_MODE                 #language en-US "Logical Interrupt Mode"
#string STR_SV_LOGICAL_INT_MODE_HELP            #language en-US "Logical Interrupt Mode"
#string STR_SV_LOGICAL_INT_MODE0                #language en-US "Flat"
#string STR_SV_LOGICAL_INT_MODE1                #language en-US "Cluster"

#string STR_KTI_SV_ACT_ON_OVERRIDE              #language en-US "Halt If Per Link Option Mismatch" 
#string STR_KTI_SV_ACT_ON_OVERRIDE_HELP         #language en-US "Halt system boot when per link option mismatch is found."

#string STR_SV_OSB_FORCE_ALL                    #language en-US "Force OSB All The Time"
#string STR_SV_OSB_FORCE_ALL_HELP               #language en-US "Force OSB for all transactions all the time"

#string STR_SV_OSB_LO_I2E_FRC                   #language en-US "Force OSB Local InvI2E"
#string STR_SV_OSB_LO_I2E_FRC_HELP              #language en-US "Force OSB for these transactions all the time"
#string STR_SV_OSB_LO_I2E                       #language en-US "OSB Local InvI2E"
#string STR_SV_OSB_LO_I2E_HELP                  #language en-US "OSB Local InvI2E"
#string STR_SV_OSB_LO_I2E_AD_VNA_TH             #language en-US "OSB Local InvI2E AdVnaTh"
#string STR_SV_OSB_LO_I2E_AD_VNA_TH_HELP        #language en-US "OSB Local InvI2E AD VNA Credit threshold: 0 - 15; default 1"
#string STR_SV_OSB_LO_I2E_AD_EGR_TH             #language en-US "OSB Local InvI2E AdEgrTh"
#string STR_SV_OSB_LO_I2E_AD_EGR_TH_HELP        #language en-US "OSB Local InvI2E AD Egress Credit threshold: 0 - 15, default 0"

#string STR_SV_MCTP_BROADCAST_EN                #language en-US "MCTP Broadcast Traffic"
#string STR_SV_MCTP_BROADCAST_EN_HELP           #language en-US "MCTP Broadcast Traffic: Enable, Disable, Auto"

#string STR_SV_KTI_EV_DEBUG_PRINT_EN            #language en-US "UPI EV Debug Printouts"
#string STR_SV_KTI_EV_DEBUG_PRINT_EN_HELP       #language en-US "Print EV information - UPI jitter margins and Rx stats - into serial output"

#string STR_KTI_LINK_SCRAMBLE                   #language en-US "Link Scrambling"
#string STR_KTI_LINK_SCRAMBLE_HELP              #language en-US "Link Scrambling"
#string STR_KTI_FAST_FREQ_RESET                 #language en-US "Fast Freq Change Reset"
#string STR_KTI_FAST_FREQ_RESET_HELP            #language en-US "FAST to FAST freq changes w/out PWR_GOOD reset"

#string STR_KTI_PRBS                            #language en-US "Bit Lock Retrain w/ Pattern"
#string STR_KTI_PRBS_HELP                       #language en-US "Bit Lock Retrain with pattern, 0: Use clock pattern, 1: Use pattern in bitlock/retraining, 2: AUTO Use EPARAM table value"
#string STR_KTI_L0P_DFX                         #language en-US "Force Disable Tx L0p"
#string STR_KTI_L0P_DFX_HELP                    #language en-US "Force Disable Tx L0p"
#string STR_KTI_L1_DFX                          #language en-US "Force Disable L1"
#string STR_KTI_L1_DFX_HELP                     #language en-US "Force Disable L1"

#string STR_KTI_ADAPTIVE_RX                     #language en-US "UPIAdaptiveRxEn"
#string STR_KTI_ADAPTIVE_RX_HELP                #language en-US "UPIAdaptiveRxEn"
#string STR_KTI_FORCE_UNUSED_L1                 #language en-US "UPIForceUnusedL1En"
#string STR_KTI_FORCE_UNUSED_L1_HELP            #language en-US "UPIForceUnusedL1En"
#string STR_KTI_INIT_ABORT_FREEZE               #language en-US "UPIInitAbortFreeze"
#string STR_KTI_INIT_ABORT_FREEZE_HELP          #language en-US "UPIInitAbortFreeze"


#string STR_KTI_STAGGERING_INIT                 #language en-US "UPIStaggeringInitEn"
#string STR_KTI_STAGGERING_INIT_HELP            #language en-US "UPIStaggeringInitEn"
#string STR_KTI_STAGGER_SCRAM_L0                #language en-US "UPIStaggerScramL0En"
#string STR_KTI_STAGGER_SCRAM_L0_HELP           #language en-US "UPIStaggerScramL0En"

#string STR_KTI_ADAPT_RX_OVERRIDE               #language en-US "Use ADAPTIVE_RX_TYPE"
#string STR_KTI_ADAPT_RX_OVERRIDE_HELP          #language en-US "0 - 17, 16: SI_ADAPTIVE_RX_TYPE = SI default, 17: MAX_ADAPTIVE_RX_TYPE == AUTO == Use EPARAM"

#string STR_KTI_R3Q_TX_TRH_L0P                  #language en-US "R3Q Tx Threshold L0p"
#string STR_KTI_R3Q_TX_TRH_L0P_HELP             #language en-US "Threshold value used when in L0p state: 1 - 30h (48); default 0xFF (255) = Auto"

#string STR_KTI_L0P_BLOCKING                    #language en-US "L0p Blocking"
#string STR_KTI_L0P_BLOCKING_HELP               #language en-US "Latency for L0p enter and exit flow, program L0p blocking or none blocking values based on speed"

#string STR_KTI_AD_RING_VNA_CREDIT_ARB_THRESHOLD        #language en-US "QpiAdVNACreditArbThreshold"
#string STR_KTI_AD_RING_VNA_CREDIT_ARB_THRESHOLD_HELP   #language en-US "AD Ring VNA Credit Arbitration Threshold"

#string STR_SV_SEND_RD_DATA_AS_MIG              #language en-US "Send Rd Data As Migratory"
#string STR_SV_SEND_RD_DATA_AS_MIG_HELP         #language en-US "Send RdDataMigratory instead of RdData, so that a modified line can be returned."
#string STR_SV_ENABLE_M_PRIME                   #language en-US "M-prime state"
#string STR_SV_ENABLE_M_PRIME_HELP              #language en-US "Cache forwarded modified line in M-prime state instead of M-state."

#string STR_SV_CBO_TOR_TIMEOUT                  #language en-US "CBO TOR Timeout"
#string STR_SV_CBO_TOR_TIMEOUT_HELP             #language en-US "Enable UPI Timeout for certain classes of UPI transactions."
#string STR_SV_CBO_TOR_ENTRY_CTR_INC            #language en-US "Upper Base Counter Inc"
#string STR_SV_CBO_TOR_ENTRY_CTR_INC_HELP       #language en-US "Indication of which bit of upper base counter increments entry counter. 8 is AUTO."
#string STR_SV_CBO_TOR_LEVEL1                   #language en-US "Level 1 Timeout Offset"
#string STR_SV_CBO_TOR_LEVEL1_HELP              #language en-US "Encoded UPI Level 1 Timeout offset. Offsets must be greater than 1. 32 is AUTO"
#string STR_SV_CBO_TOR_LEVEL3                   #language en-US "Level 3 Timeout Offset"
#string STR_SV_CBO_TOR_LEVEL3_HELP              #language en-US "Encoded UPI Level 3 Timeout offset. Offsets must be greater than 1. 32 is AUTO"
#string STR_SV_CBO_TOR_LEVEL4                   #language en-US "Level 4 Timeout Offset"
#string STR_SV_CBO_TOR_LEVEL4_HELP              #language en-US "Encoded UPI Level 4 Timeout offset. Offsets must be greater than 1. 32 is AUTO"
#string STR_SV_CBO_TOR_LEVEL6                   #language en-US "Level 6 Timeout Offset"
#string STR_SV_CBO_TOR_LEVEL6_HELP              #language en-US "Encoded UPI Level 6 Timeout offset. Offsets must be greater than 1. 32 is AUTO"

#string STR_TOTISOC_RTID_PROMPT                #language en-US "Total Isoc Rtid"
#string STR_TOTISOC_RTID_HELP                  #language en-US "Total Isoc Rtid:[1:11], 11(default)

//
// End of file
//

